## Data Visualization with Python Part 1<br>
Data quality, Consistency, Merging

### Question(1),(2),(3) import libraries, customer csv file

In [1]:
#import libraries
import pandas as pd
import numpy as np
import os 
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

/* Create path (to project file), import orders & products csv files */

In [2]:
path = r'/Users/margoshogren/Desktop/1 Margo-CF Folder/4 Python/4-2023 Instacart Basket Analysis'
df_cust = pd.read_csv(os.path.join(path,'2 Data','original data','customers.csv'),index_col = False)

In [3]:
df_cust.shape

(206209, 10)

### Question(4) Wrangle the data so that it follows consistent logic<br>
rename columns with illogical names and drop columns

In [4]:
df_cust.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [13]:
#rename Surnam to Last_Name
df_cust.rename(columns = {'Surnam': 'Last_Name'}, inplace = True)

In [14]:
#rename STATE to State
df_cust.rename(columns = {'STATE': 'State'}, inplace = True)

In [15]:
#rename fam_status to Marital_status
df_cust.rename(columns = {'fam_status': 'Marital_status'}, inplace = True)

In [16]:
#rename n_dependants to no_of_dep
df_cust.rename(columns = {'n_dependants': 'no_of_dep'}, inplace = True)

In [17]:
#rename First Name to First_Name
df_cust.rename(columns = {'First Name': 'First_Name'}, inplace = True)

In [11]:
df_cust.head()

,user_id,First_Name,Last_Name,Gender,State,Age,date_joined,no_of_dep,Marital_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

### Question(5) Complete the fundamental data quality and consistency checks<br>
convert any mixed-type data, missing values and duplicates

In [18]:
#check for mixed data types
for col in df_cust.columns.tolist():
    weird = (df_cust[[col]].applymap(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)
    if len (df_cust[weird]) > 0:
        print(col)

First_Name

In [19]:
# Observation: column: First_Name needs to change to all string
df_cust['First_Name'] = df_cust['First_Name'].astype('str')

In [20]:
# Find missing values
df_cust.isnull().sum()

user_id           0
First_Name        0
Last_Name         0
Gender            0
State             0
Age               0
date_joined       0
no_of_dep         0
Marital_status    0
income            0
dtype: int64

#### Observation: No missing values were found

In [21]:
# Check df_customer for duplicate values
df_dups = df_cust[df_cust.duplicated()]

In [7]:
df_dups

Empty DataFrame
Columns: [user_id, First Name, Surnam, Gender, STATE, Age, date_joined, n_dependants, fam_status, income]
Index: []

#### Observation: No duplicates found

In [14]:
# Check customer file for anomalies in data
df_cust.describe()

             user_id            Age      no_of_dep         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

In [16]:
df_cust[df_cust['income'] > 500000]

,user_id,First_Name,Last_Name,Gender,State,Age,date_joined,no_of_dep,Marital_status,income
2018,33595,Jose,Castaneda,Male,Mississippi,65,1/12/2017,2,married,577728
6515,15931,Willie,Wyatt,Male,Louisiana,48,2/6/2017,0,single,518122
12044,658,Ernest,English,Male,Vermont,75,3/11/2017,0,divorced/widowed,576876
21704,136050,Daniel,Walter,Male,Maryland,49,5/6/2017,3,married,559700
21726,58596,Thomas,Cohen,Male,Washington,75,5/6/2017,2,married,593901
...,...,...,...,...,...,...,...,...,...,...
199982,169026,Adam,Fernandez,Male,Hawaii,46,2/26/2020,0,single,550917
200450,112113,Benjamin,Parsons,Male,Indiana,57,2/29/2020,1,married,579397
200774,71027,Lawrence,Malone,Male,Michigan,81,3/2/2020,1,married,571932
202655,98580,nan,Patterson,Male,Washington,43,3/12/2020,2,married,592409
204513,21667,Edward,Miles,Male,Tennessee,53,3/22/2020,0,single,518856

#### Observation: Several users have income > 500k, it is not an oulier

### Question(6) Combine your customer data with the rest of your prepared Instacart data.<br>
(Hint: Make sure the key columns are the same data type!)

In [29]:
# Import ords_prods_wgrps.pkl
ords_prods_merge = pd.read_pickle(os.path.join(path,'2 Data','prepared data','ords_prods_wgrps.pkl'))

In [16]:
ords_prods_merge.columns

Index(['product_id', 'product_name', 'aisle_id', 'department_id', 'prices',
       'order_id', 'user_id', 'order_number', 'orders_day_of_week',
       'order_hour_of_day', 'days_since_prior_order', 'add_to_cart_order',
       'reordered', '_merge', 'price_range_loc', 'Busiest_days',
       'busiest_period_of_day', 'max_order', 'loyalty_flag', 'Average_order',
       'Spending_flag'],
      dtype='object')

### Delete unnecessary columns: 'Unnamed: 0_y' , 'Unnamed: 0_x'

In [23]:
ords_prods_merge = ords_prods_merge.drop(columns = ['Unnamed: 0_x'])

In [24]:
ords_prods_merge = ords_prods_merge.drop(columns = ['Unnamed: 0_y'])

In [21]:
ords_prods_merge.head()

,product_id,product_name,aisle_id,department_id,prices,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,...,add_to_cart_order,reordered,_merge,price_range_loc,Busiest_days,busiest_period_of_day,max_order,loyalty_flag,Average_order,Spending_flag
0,1,Chocolate Sandwich Cookies,61,19,5.8,3139998,138,28,6,11,...,5,0,both,Mid-range product,Regularly busy,Most orders,32,Regular customer,6.935811,Low_spender
1,1,Chocolate Sandwich Cookies,61,19,5.8,1977647,138,30,6,17,...,1,1,both,Mid-range product,Regularly busy,Most orders,32,Regular customer,6.935811,Low_spender
2,1,Chocolate Sandwich Cookies,61,19,5.8,389851,709,2,0,21,...,20,0,both,Mid-range product,Busiest days,Most orders,5,New customer,7.930208,Low_spender
3,1,Chocolate Sandwich Cookies,61,19,5.8,652770,764,1,3,13,...,10,0,both,Mid-range product,Least busy,Most orders,3,New customer,4.972414,Low_spender
4,1,Chocolate Sandwich Cookies,61,19,5.8,1813452,764,3,4,17,...,11,1,both,Mid-range product,Least busy,Most orders,3,New customer,4.972414,Low_spender

In [25]:
### We can combine files with key field user_id; check data type of user_id for each df
ords_prods_merge['user_id'].dtype

dtype('int64')

In [26]:
df_cust['user_id'].dtype

dtype('int64')

In [19]:
df_cust.shape

(206209, 10)

In [22]:
ords_prods_merge.shape

(32404859, 28)

In [27]:
cust_ords_prods = df_cust.merge(ords_prods_merge, on = ['user_id'])

In [35]:
cust_ords_prods.columns

Index(['user_id', 'First_Name', 'Last_Name', 'Gender', 'State', 'Age',
       'date_joined', 'no_of_dep', 'Marital_status', 'income', 'product_id',
       'product_name', 'aisle_id', 'department_id', 'prices', 'order_id',
       'order_number', 'orders_day_of_week', 'order_hour_of_day',
       'days_since_prior_order', 'add_to_cart_order', 'reordered', '_merge',
       'price_range_loc', 'Busiest_days', 'busiest_period_of_day',
       'max_order'],
      dtype='object')

In [28]:
cust_ords_prods['_merge'].value_counts()

both          32404859
left_only            0
right_only           0
Name: _merge, dtype: int64

In [36]:
cust_ords_prods.shape

(32404859, 27)

#### Export cust file and merged cust_ords_prods

In [30]:
cust_ords_prods.to_pickle(os.path.join(path,'2 Data','prepared data','customer49.pkl'))

#### End of 4.9 Data visualization with Python part 1 -Data quality, consistency, merging